# Разбиение на куски
# На вход программе подаются две строки, на одной символы, на другой число n. Из первой строки формируется список.
# Реализуйте функцию chunked(), которая принимает на вход список и число, задающее размер чанка (куска), а возвращает
# список из чанков указанной длины.
# Формат входных данных : На вход программе подается строка текста, содержащая символы, отделенные символом пробела и
# число n на отдельной строке.  Формат выходных данных  Программа должна вывести указанный вложенный список.

s = str(input())
n = int(input())
ls = s.split()
x = 0
row = []
ls_new = []

for c in range(len(ls)):
    row.append(ls[c])
    if c == len(ls) - 1:
        ls_new.append(row)
        break
    if len(row) == n:
        ls_new.append(row)
        row = []
print(ls_new)
