# put your python code here
# Роскомнадзор запретил букву а
# Необходимо написать программу, реализующую алгоритм
# написания этой песни. Алгоритм выводит в конце предложения следующую
# в алфавитном порядке букву, если она встречается в строке текста, а очередную
# строку отображает уже без этой буквы.
#
# Формат входных данных
# На вход программе подается одно слово, записанное строчными русскими буквами без буквы "ё".
#
# Формат выходных данных
# Программа должна вывести в соответствии с указанным алгоритмом строки, количество
# которых равно количеству разных букв в строке, которая получается путем конкатенации
# введенного слова и строки "запретил букву".



s = str(input())

s1 = 'запретил букву'
s11 = ' '
s3 = s + s11 + s1
s4 = ''
for c in range(len(s3)):
    if s3[c] not in s4:
        s4 = s4 + s3[c]
s5 = s4.replace(' ', '')
rus_alf = 'абвгдежзийклмнопрстуфхцчшщъыьэюя'
for c in range(len(rus_alf)):
    if rus_alf[c] in s3:
        print((s3).strip() + ' ' + rus_alf[c])
        s3 = s3.replace(rus_alf[c], '')
        s3 = s3.replace('  ', ' ')
