# Последовательность Трибоначчи
# Напишите программу, которая считывает натуральное число  n и выводит первые  n чисел последовательности Трибоначчи.
# Формат входных данных
# На вход программе подается одно число n  (n≤100) – количество членов последовательности.
# Формат выходных данных:  Программа должна вывести члены последовательности Трибоначчи, отделенные символом пробела.
# Примечание. Последовательность Трибоначчи – последовательность натуральных чисел, где каждое последующее число является суммой трех предыдущих:


n = int(input())
f1 = 1
f2 = 1
f3 = 1
for c in range(n):
    print(f1, end=' ')
    f1, f2, f3 = f2, f3, f1 + f2 + f3
    